# Q1 ------------------------------------------------------------------------
import pandas as pd

x = pd.read_excel(r'C:\Users\owner\Desktop\sparta\본캠프\test\excel_csv\관서별 5대범죄 발생 및 검거.xlsx')
y = pd.read_csv(r'C:\Users\owner\Desktop\sparta\본캠프\test\excel_csv\pop_kor.csv')

ddf = pd.DataFrame(x)
dddf = pd.DataFrame(y)

print(ddf.head(2))

# Q2 ------------------------------------------------------------------------
# 딕셔너리, 값(value), 키(key). isna, mapping, df.columns

data = {
    '관서명': ['서대문서', '수서서', '강서서', '서초서', '서부서', '중부서', '종로서', '남대문서',
'혜화서', '용산서', '성북서', '동대문서', '마포서', '영등포서', '성동서', '동작서', '광진서','강북서', 
'금천서', '중랑서', '강남서', '관악서', '강동서', '종암서'  '구로서', '양천서', '송파서', '노원서'  
'방배서', '은평서', '도봉서']
}
df = pd.DataFrame(data)

data2 = {
    '구별': ['서대문구', '강남구', '강서구', '서초구',
'은평구', '중구', '종로구', '중구', '종로구', '용산구', '성북구', '동대문구',
'마포구', '영등포구', '성동구', '동작구', '광진구', '강북구', '금천구', '중랑구',
'강남구', '관악구', '강동구', '성북구', '구로구', '양천구', '송파구', '노원구', 
'서초구', '은평구', '도봉구']
}
df2 = pd.DataFrame(data2)

mapping = {
'서대문서': '서대문구', '수서서': '강남구', '강서서': '강서구', '서초서': '서초구',
'서부서': '은평구', '중부서': '중구', '종로서': '종로구', '남대문서': '중구',
'혜화서': '종로구', '용산서': '용산구', '성북서': '성북구', '동대문서': '동대문구',
'마포서': '마포구', '영등포서': '영등포구', '성동서': '성동구', '동작서': '동작구',
'광진서': '광진구', '강북서': '강북구', '금천서': '금천구', '중랑서': '중랑구',
'강남서': '강남구', '관악서': '관악구', '강동서': '강동구', '종암서': '성북구', 
'구로서': '구로구', '양천서': '양천구', '송파서': '송파구', '노원서': '노원구', 
'방배서': '서초구', '은평서': '은평구', '도봉서': '도봉구'
}

temp = pd.Series(name='구별')
for office_name in ddf['관서명']:
    if office_name in mapping:
        temp = pd.concat([temp, pd.Series([mapping[office_name]],name='구별')], ignore_index=True)
    else :
        temp = pd.concat([temp, pd.Series([None],name='구별')], ignore_index=True)
ddf = pd.concat([ddf, temp], axis=1)
ddf['구별'] = ddf['구별'].fillna('구 없음')

print(ddf)
# # Q3 ------------------------------------------------------------------------

# pivot_table 을 사용하여 관서별 데이터를 구별 데이터로 변경하고, 같은 구의 경우에는 sum을 적용하여 더해주세요. (index : 관서 이름 -> 구 이름)
pivot = pd.pivot_table(index='이름')
print(pivot)